EnumValue_NumberAttributeValuesDoesNotCorrespondToNumberAttributes=Die Anzahl von Attributwerten stimmt nicht \u00FCberein mit der Anzahl von Attributen, die im Wertebeh\u00E4lter {0} definiert sind.
EnumValue_EnumTypeAbstract=Dieser Aufz\u00E4hlungswert ist au\u00DFer Gebrauch, da der Aufz\u00E4hlungstyp {0} abstrakt ist.
EnumValue_EnumTypeDoesNotContainValues=Dieser Aufz\u00E4hlungswert ist au\u00DFer Gebrauch, da der Aufz\u00E4hlungstyp {0} keine Aufz\u00E4hlungswerte enth\u00E4lt.

EnumAttributeValue_ValueNotParsable=Der Wert f\u00FCr {0} entspricht nicht dem Datentyp {1}.
EnumAttributeValue_UniqueIdentifierValueEmpty=Der Wert f\u00FCr den eindeutigen Kennzeichner {0} darf nicht leer sein.
EnumAttributeValue_UniqueIdentifierValueNotUnique=Der Wert f\u00FCr den eindeutigen Kennzeichner {0} muss einzigartig sein.
EnumAttributeValue_LiteralNameValueNotJavaConform=Das von diesem Wert referenzierte Attribut {0} wird als Literalname verwendet, der aktuelle Wert ist aber kein valider Java-Identifier.

EnumAttribute_NameMissing=Kein Name angegeben.
EnumAttribute_DuplicateName=Der Name {0} wird bereits in diesem Aufz\u00E4hlungstyp als Attributname verwendet.
EnumAttribute_DatatypeMissing=Kein Datentyp angegeben.
EnumAttribute_DatatypeDoesNotExist=Der Datentyp {0} existiert nicht.
EnumAttribute_DatatypeIsPrimitive=Der Datentyp {0} ist ein primitiver Datentyp, diese sind aber f\u00FCr Attribute von Aufz\u00E4hlungstypen nicht erlaubt.
EnumAttribute_DatatypeIsVoid=Der Datentyp void ist f\u00FCr Attribute von Aufz\u00E4hlungstypen nicht erlaubt.
EnumAttribute_DatatypeIsAbstract=Der Datentyp {0} ist abstrakt.
EnumAttribute_DatatypeIsContainingEnumTypeOrSubclass=Der Datentyp darf nicht der beinhaltende Aufz\u00E4hlungstyp oder eine Unterklasse davon sein.
EnumAttribute_DuplicateLiteralName=Nur genau ein Attribut darf als Literalname markiert werden.
EnumAttribute_NoSuchAttributeInSupertypeHierarchy=Dieses Attribut wurde als geerbt markiert, es existiert aber kein Attribut {0} in der Superklassen-Hierarchie.
EnumAttribute_LiteralNameNotOfDatatypeString=Dieses Attribut wird als Literalname verwendet, der Datentyp muss daher String sein.
EnumAttribute_LiteralNameButNotUniqueIdentifier=Dieses Attribut wird als Literalname verwendet, daher muss es auch eindeutiger Kennzeichner sein.
EnumAttribute_DuplicateUsedAsNameInFaktorIpsUi=Nur genau ein Attribut darf zur Verwendung als Name f\u00FCr das Faktor-IPS UI markiert werden.
EnumAttribute_DuplicateUsedAsIdInFaktorIpsUi=Nur genau ein Attribut darf zur Verwendung als ID f\u00FCr das Faktor-IPS UI markiert werden.
EnumAttribute_EnumDatatypeDoesNotContainValuesButParentEnumTypeDoes=Der Datentyp {0} ist ein Aufz\u00E4hlungstyp, der keine Aufz\u00E4hlungswerte enth\u00E4lt.

EnumType_NotInheritedAttributesInSupertypeHierarchySingular=Es existiert 1 Attribut in der Superklassen-Hierarchie, welches dieser Aufz\u00E4hlungstyp noch nicht erbt: {0}
EnumType_NotInheritedAttributesInSupertypeHierarchyPlural=Es existieren {0} Attribute in der Superklassen-Hierarchie, welche dieser Aufz\u00E4hlungstyp noch nicht erbt. Erstes nicht geerbtes Attribut: {1}
EnumType_NoLiteralNameAttribute=Dieser Aufz\u00E4hlungstyp hat kein Attribut, welches zur Verwendung als Literalname markiert ist.
EnumType_NoUsedAsIdInFaktorIpsUiAttribute=Dieser Aufz\u00E4hlungstyp hat kein Attribut, welches zur Verwendung als ID im Faktor-IPS UI markiert ist.
EnumType_NoUsedAsNameInFaktorIpsUiAttribute=Dieser Aufz\u00E4hlungstyp hat kein Attribut, welches zur Verwendung als Name im Faktor-IPS UI markiert ist.

EnumContent_ReferencedEnumAttributesCountInvalid=Die Anzahl der referenzierten Attribute stimmt nicht \u00FCberein mit der Anzahl der Attribute, die im Aufz\u00E4hlungstyp {0} definiert sind.