Column_msgInvalidName=Der gew\u00E4hlte Name ist nicht g\u00FCltig.
Column_msgPrimitvesArentSupported=Spalten muessen ein nicht-primitiven Datatyp haben.

ColumnRange_msgMissingColumn=Die Tabelle enth\u00E4lt keine Spalte mit dem Namen {0}.
ColumnRange_msgNameInvalidJavaIdentifier=Der angegebene Name ist ungültig.
ColumnRange_msgParameterEmpty=Der Name darf nicht leer sein.
ColumnRange_msgTwoColumnRangeFromToColumnWithDifferentDatatype=Die Datentypen der Von-Spalte und der Bis-Spalte des Bereichs sind unterschiedlich

ForeignKey_msgForeignKeyDatatypeMismatch=Die Spalte {0} des Fremdschl\u00FCssel hat einen anderen Datentyp als dessen zugeh\u00F6rige Spalte {1}. 
ForeignKey_msgInvalidKeyItem=Das Schl\u00FCsselelement {0} benennt keine Spalte und keinen Bereich.
ForeignKey_msgInvalidRange=Die Datentyp-Validit\u00E4t kann nicht gepr\u00FCft werden, da der Bereich ung\u00FCltig ist.
ForeignKey_msgKeyDatatypeMismatch=Das Element {0} des Fremdschl\u00FCssel hat einen anderen Datentyp als das dazugeh\u00F6rige Element {1}. 
ForeignKey_msgKeyItemMissmatch=Das Fremdschl\u00FCssel-Element ist ein Bereich, der referenzierte Schl\u00FCssel ist jedoch eine Spalte\!
ForeignKey_msgKeyMissmatch=Das Element des Fremdschl\u00FCssels ist eine Spalte, aber das Element des referenzierten Schl\u00FCssels ist ein Bereich\!
ForeignKey_msgMalformedForeignKey=Der Fremdschl\u00FCssel muss so viele Schl\u00FCsselemente enthalten wie der Index.
ForeignKey_msgMissingUniqueKey=Die Tabelle {0} enth\u00E4lt keinen Index {1}. 
ForeignKey_msgNotAColumn=Die Datentyp-Validit\u00E4t kann nicht gepr\u00FCft werden, da das Element {0} im referenzierten Index keine Spalte identifiziert.
ForeignKey_msgNotARange=Die Datentyp-Validit\u00E4t kann nicht gepr\u00FCft werden, da das Element {0} im referenzierten Unique Key keinen Bereich benennt.
ForeignKey_msgReferencedRangeInvalid=Die Datentyp-Validit\u00E4t kann nicht gepr\u00FCft werden, da der Bereich im referenzierten Schl\u00FCssel ung\u00FCltig ist.

Index_msgKeyItemMismatch=Das Schl\u00FCsselelement {0} bezieht sich weder auf einen Spalte noch einen Bereich.
Index_msgTooLessItems=Ein Schl\u00FCssel muss mindestens ein Element enthalten.
Index_wrong_sequence=Die Bereichsschl\u00FCsselelemente m\u00FCssen nach den Spaltenschl\u00FCsselelementen angeordnet werden.

TableAccessFunctionDescription=Die Funktion ermittelt die Zeile identifiziert durch {0} und liefert den Wert in der Spalte {1}.

TableStructureType_labelEnumTypeModel=Aufz\u00E4hlungstyp (Werte sind Teil des Modells)
