#File modified by LocalizationHelper
#Fri Apr 20 11:09:40 CEST 2007
ContentPage_title=Inhalte
ContentPage_Column=Spalte 
ContentPage_msgAddMany=Der Tabelleninhalt besteht aus {1} Spalten. Die Tabellenstruktur ben\u00F6tigt {0} weitere. Bitte geben Sie die Indizes (durch Komma getrennt) der Spalten ein, nach denen die neuen Spalten eingef\u00FCgt werden sollen. Verwenden Sie 0, um die neue Spalte als erste Spalte einzuf\u00FCgen, 1 um die neue Spalte nach der Ersten einzuf\u00FCgen und so weiter. Um zwei neue Spalten hinter der ersten einzuf\u00FCgen geben Sie zum Beispiel "1,1" ein.
ContentPage_msgAddOne=Der Tabelleninhalt besteht aus {0} Spalten. Die Tabellenstrutkur ben\u00F6tigt eine weitere Spalte. Bitte geben Sie den Index der Spalte ein, nach welcher die neue Spalte eingef\u00FCgt werden soll. Verwenden Sie 0, um die neue Spalte als erste Spalte einzuf\u00FCgen, 1 um die neue Spalte nach der Ersten einzuf\u00FCgen und so weiter.
ContentPage_titleTooMany=Zu viele Spalten
TableContentsEditor_TableContentsEditor_title2=Tabelleninhalt\: 
ContentPage_msgMissingStructure=Die urspr\u00FCnglich gew\u00E4hlte Tabellenstruktur ({0}) konnte nicht gefunden werden - bitte w\u00E4hlen Sie eine neue.
ContentPage_msgNoStructureFound=Die Tabellenstruktur {0} konnte nicht gefunden werden.
ContentPage_titleMissingColumns=Fehlende Spalten
ContentPage_titleMissingColumn=Fehlende Spalte
ContentPage_msgRemoveOne=Der Tabelleninhalt besteht aus {0} Spalten. Dies ist eine mehr als die Tabellensturktur erlaubt. Bitte geben Sie den Index (Null-basiert) der zu l\u00F6schenden Spalte an. Um zum Beispiel die zweite Spalte zu l\u00F6schen geben Sie "1" ein.
ContentPage_msgRemoveMany=Der Tabelleninhalt besteht aus {1} Spalten. Das sind {0} mehr, als die Tabellenstruktur erlaubt. Bitte geben Sie die Indizes (Null-basiert) der zu l\u00F6schenden Spalte durch Komma getrennt an. Um beispielsweise die erste und dritte Spalte zu l\u00F6schen geben Sie "0,2" ein.
ContentPage_msgCantShowContent=Falsche Spaltenanzahl - der Inhalt kann nicht vollst\u00E4ndig angezeigt werden.
ContentPage_errorNoDuplicateIndices=Keine doppelten Indizes erlaubt.
ContentPage_errorIndexOutOfRange=Der Index {0} liegt au\u00DFerhalb der Bereichsgrenzen.
ContentPage_errorInvalidValueOne="{0}" ist nicht g\u00FCltig, es sind nur Zahlen erlaubt.
ContentPage_errorInvalidValueMany="{0}" ist nicht g\u00FCltig, es sind nur Zahlen und Komma (zum Trennen der Indizes) erlaubt.
ContentPage_errorTooManyOne=Zu viele Indizes, es wird nur ein Index ben\u00F6tigt.
ContentPage_errorTooManyMany=Zu viele Indizes, es werden nur {0} ben\u00F6tigt.
ContentPage_errorOneMore=Es wird noch ein weiterer Index ben\u00F6tigt.
ContentPage_errorManyMore=Es werden noch {0} weitere Indizes ben\u00F6tigt.
SetStructureDialog_titleChooseTableStructure=Tabellenstruktur ausw\u00E4hlen
SetStructureDialog_labelNewStructure=Neue Tabellenstruktur\:
SetStructureDialog_msgStructureDontExist=Tabellenstruktur {0} existiert nicht.
NewRowAction_Label=Zeile einf\u00FCgen
NewRowAction_Tooltip=F\u00FCgt eine neue Zeile unterhalb der ausgew\u00E4hlten Zeile ein
NavigateToTableStructureAction_Label=Tabellenstruktur
NavigateToTableStructureAction_ToolTip=\u00D6ffne die Tabellenstruktur, auf die dieser Tabelleninhalt basiert, in einem neuen Editor.
