ProductCmptType_InconsistentTypeHierarchies=Die Typhierarchie der Produktbausteinklassen passt nicht zu der Vertragsteilklasse.  
ProductCmptType_PolicyCmptTypeDoesNotExist=Der Typ {0} existiert nicht.
ProductCmptType_notMarkedAsConfigurable={0} ist nicht als konfigurierbar markiert.
ProductCmptType_multiplePropertyNames=Mehrfach vergebener Eigenschaftsname {0}. Bei Eigenschaftsnamen wird die Grosskleinschreibung ber\u00fccksichtigt. Assoziationen, Attribute, Formeln und Tabellenverwendungen sind Eigenschaften einer Produktbausteinklasse.
ProductCmptType_policyCmptTypeDoesNotSpecifyThisType={0} definiert nicht diesen Typ oder einen ihrer Supertypen als Konfigurationstyp.
ProductCmptType_policyCmptTypeNotValid=Der konfigurierte Vertragsteiltyp {0} ist fehlerhaft; deshalb ist f\u00fcr diesen Typ keine Codegenerierung m\u00f6glich.
ProductCmptType_TypeMustConfigureAPolicyCmptTypeIfSupertypeDoes=Der Typ muss einen Vertragsteiltypen konfigurieren wenn der Supertyp eine konfiguriert\!
ProductCmptType_DuplicateFormulaName=Doppelter Formelname {0}.
ProductCmptType_iconFileCannotBeResolved=Die Datei fuer das Icon kann nicht gefunden werden. Pfad pr\u00fcfen: "
ProductCmptType_msgProductCmptTypeAbstractWhenPolicyCmptTypeAbstract=Dieser Produktbausteintyp muss abstrakt sein, da der zugeordnete Vertragsteiltyp abstrakt ist.
ProductCmptType_msgDuplicateFormulasNotAllowedInSameType=Formeln d\u00fcrfen innerhalb eines Produktbausteintyps nicht den gleichen Namen haben.
ProductCmptType_msgOverloadedFormulaMethodCannotBeOverridden=Diese Methode ist durch die Formelmethode {0} \u00fcberladen. \u00dcberladene Formelmethoden d\u00fcrfen nicht \u00fcberschrieben werden.
ProductCmptType_MustInheritFromASupertype=Dieser Produktbausteintyp muss von einer Superklasse abgeleitet werden, da die entsprechende Vertragsteilklasse von einer Superklasse abgeleitet ist.
ProductCmptType_caption=Produktbausteintyp
ProductCmptType_pluralCaption=Produktbausteintypen
ProductCmptType_error_supertypeNotMarkedAsLayerSupertype=Dieser Typ ist als 'Layer Supertype' markiert, daher muss der Supertyp {0} ebenfalls ein 'Layer Supertype' sein.
ProductCmptType_error_settingChangingOverTimeDiffersFromSettingInSupertype=Die Einstellung f\u00FCr Produktbausteine haben {0} unterscheidet sich von der Einstellung im Supertyp {1}.

ProductCmptTypeAssociation_error_MatchingAssociationDoesNotReferenceThis=Die Assoziation {0} in der Vertragsteilklasse {1} kann nicht von dieser Assoziation konfiguriert werden.
ProductCmptTypeAssociation_error_MatchingAssociationDuplicateName=Die Assoziation {0} konfiguriert ebenfalls eine Assoziation mit diesem Namen. 
ProductCmptTypeAssociation_error_MatchingAssociationInvalid=Die Assoziation {0} in der Vertragsteilklasse {1} referenziert nicht diese Assoziation.
ProductCmptTypeAssociation_error_matchingAssociationNotFound=Kann die entsprechende Assoziation {0} in der Vertragsteilklasse {1} nicht finden.
ProductCmptTypeAssociation_errorMsg_constrained_changeOverTime_missmatch=Die Einstellung zur Ver\u00e4nderung im Zeitablauf muss wie in der \u00fcberschriebenen Beziehung gesetzt sein.
ProductCmptTypeAssociation_Msg_DeriveUnionChangingOverTimeMismatch_SubetChanging=Diese Teilmenge (einer Abgeleiteten Vereinigung) ist als ver\u00e4nderlich im Zeitablauf definiert, aber die entsprechende Abgeleitete Vereinigung ({0}) ist als unver\u00e4nderlich (statisch) definiert. Beide m\u00fcssen entweder ver\u00e4nderlich oder statisch sein, niemals gegens\u00e4tzlich.
ProductCmptTypeAssociation_Msg_DeriveUnionChangingOverTimeMismatch_SubetStatic=Diese Teilmenge (einer Abgeleiteten Vereinigung) ist als unver\u00e4nderlich (statisch) definiert, aber die entsprechende Abgeleitete Vereinigung ({0}) ist als ver\u00e4nderlich im Zeitablauf definiert. Beide m\u00fcssen entweder ver\u00e4nderlich oder statisch sein, niemals gegens\u00e4tzlich.

TableStructureUsage_msgTableStructureNotExists=Die Tabellenstruktur {0} wurde nicht gefunden.
TableStructureUsage_msgRoleNameAlreadyInSupertype=Es existiert schon eine Tabellen-Struktur-Nutzung mit dem Rollennamen {0} in einem Supertyp. Das \u00dcberschreiben ist nicht m\u00f6glich.
TableStructureUsage_msgInvalidRoleName=Ung\u00FCltiger Rollenname\: {0}
TableStructureUsage_msgAtLeastOneStructureMustBeReferenced=Es muss mindestens eine Tabellenstruktur zugewiesen werden.
TableStructureUsage_msg_Singular=eine Tabellenstruktur
TableStructureUsage_msg_Plural=Tabellenstrukturen

ProductCmptTypeMethod_Formula_msg_Plural=Formeln
ProductCmptTypeMethod_Formula_msg_Singular=eine Formel
ProductCmptTypeMethod_FormulaNameIsMissing=Der Name der Formel fehlt.
ProductCmptTypeMethod_FormulaSignatureDatatypeMustBeAValueDatatype=Eine Formelsignatur muss eine Wertyp zur\u00FCckgeben.
ProductCmptTypeMethod_msgNoOverloadableFormulaInSupertypeHierarchy=Die Formel kann nicht \u00fcberladen werden, da es keine Formel in der Typhierarchie mit dem gleichen Namen gibt. Das \u00dcberladen von Formeln innerhalb einer Produktklasse ist nicht m\u00f6glich. 
ProductCmptTypeMethod_msgOptionalNotAllowedBecauseNotOptionalInSupertypeHierarchy=Die \u00fcberladene Formel muss als erforderlich gekennzeichnet sein, weil die Formel in der Typhierarchie erforderlich ist.
ProductCmptTypeMethod_FormulaSignatureMustntBeAbstract=Formelsignaturen d\u00fcrfen nicht als abstrakt markiert werden. (Die Entscheidung, ob die Formel durch \u00dcberschreiben dieser Methode mit generiertem Javacode oder durch Interpretation der Formel ausgef\u00fchrt wird, ist eine Sache des Generators.)
ProductCmptTypeMethod_msgChangingOverTimeNotAllowedBecauseNotChangingOverTimeInSupertypeHierarchy=Die Methode muss als nicht \u00e4nderbar in Anpassungsstufen definiert sein, weil die Methode in einer Superklasse als nicht \u00e4nderbar definiert ist.
ProductCmptTypeMethod_msgNotChangingOverTimeNotAllowedBecauseChangingOverTimeInSupertypeHierarchy=Die Methode muss als \u00e4nderbar in Anpassungsstufen definiert sein, weil die Methode in einer Superklasse als \u00e4nderbar definiert ist.

ProductCmptCategory_msgNameIsEmpty=Es muss ein Name f\u00fcr die Kategorie angegeben werden.
ProductCmptCategory_msgNameAlreadyUsedInTypeHierarchy=Der Name ''{0}'' wird bereits als Kategoriename in der Typhierarchie der Produktbausteinklasse ''{1}'' verwendet.
ProductCmptCategory_msgInheritedButNotFoundInSupertypeHierarchy=Die Kategorie ''{0}'' ist als vererbt markiert, es konnte aber keine entsprechende Kategorie in der Ableitungshierarchie gefunden werden.
ProductCmptCategory_msgInheritedButNoSupertype=Die Kategorie ''{0}'' ist als vererbt markiert, die Produktbausteinklasse ''{1}'' spezifiziert aber keine Superklasse.
ProductCmptCategory_DuplicateDefaultsForFormulaSignatureDefinitions=Mehr als eine Kategorie ist als Standard f\u00fcr Formelsignaturen markiert.
ProductCmptCategory_DuplicateDefaultsForValidationRules=Mehr als eine Kategorie ist als Standard f\u00fcr konfigurierbare Regeln markiert.
ProductCmptCategory_DuplicateDefaultsForTableStructureUsages=Mehr als eine Kategorie ist als Standard f\u00fcr verwendete Tabellen markiert.
ProductCmptCategory_DuplicateDefaultsForPolicyCmptTypeAttributes=Mehr als eine Kategorie ist als Standard f\u00fcr \u00e4nder- und konfigurierbare Attribute eines Vertragsteiltyps markiert.
ProductCmptCategory_DuplicateDefaultsForProductCmptTypeAttributes=Mehr als eine Kategorie ist als Standard f\u00fcr Attribute eines Produktbausteintyps markiert.
ProductCmptCategory_NoDefaultForFormulaSignatureDefinitions=In der Produktbausteinklasse ''{0}'' und deren Superklassen-Hierarchie existiert keine Standardkategorie f\u00fcr Formelsignaturen, obwohl Eigenschaften dieser Art im Typ existieren.
ProductCmptCategory_NoDefaultForValidationRules=In der Produktbausteinklasse ''{0}'' und deren Superklassen-Hierarchie existiert keine Standardkategorie f\u00fcr konfigurierbare Regeln, obwohl Eigenschaften dieser Art im Typ existieren.
ProductCmptCategory_NoDefaultForTableStructureUsages=In der Produktbausteinklasse ''{0}'' und deren Superklassen-Hierarchie existiert keine Standardkategorie f\u00fcr verwendete Tabellen, obwohl Eigenschaften dieser Art im Typ existieren.
ProductCmptCategory_NoDefaultForPolicyCmptTypeAttributes=In der Produktbausteinklasse ''{0}'' und deren Superklassen-Hierarchie existiert keine Standardkategorie f\u00fcr \u00e4nder- und konfigurierbare Attribute eines Vertragsteiltyps, obwohl Eigenschaften dieser Art im Typ existieren.
ProductCmptCategory_NoDefaultForProductCmptTypeAttributes=In der Produktbausteinklasse ''{0}'' und deren Superklassen-Hierarchie existiert keine Standardkategorie f\u00fcr Attribute eines Produktbausteintyps, obwohl Eigenschaften dieser Art im Typ existieren.

ProductCmptPropertyExternalReference_msgReferencedPropertyCouldNotBeFound=Die referenzierte Produkteigenschaft ''{1}'' vom Typ ''{0}'' konnte nicht gefunden werden.

ProductCmptPropertyValidator_msgTypeDoesNotAcceptChangingOverTime=Die Eigenschaft {0} kann nicht in {1} ver\u00e4ndert werden, da der Typ keine {1} erlaubt.

ProductCmptTypeAttribute_msg_invalidValueSet=Die Wertemenge {0} des Attributs {1} ist nicht erlaubt.
ProductCmptTypeAttribute_msgOverwritten_singleValueMultipleValuesDifference=Die Einstellung "Einzelner Wert"/"Mehrere Werte" muss der Konfiguration des \u00fcberschriebenen Attributes entsprechen.
ProductCmptTypeAttribute_msgOverwritten_multilingual_different=Die Einstellung f\u00fcr mehrsprachige Werte muss der Konfiguration des \u00fcberschriebenen Attributes entsprechen.
ProductCmptTypeAttribute_msgDefaultValueNotInValueSetWhileHidden=Der Vorgabewert "{0}" muss im Wertebereich enthalten sein, da das Attribut ausgeblendet ist.
