#File modified by LocalizationHelper
#Thu Aug 24 14:56:20 CEST 2006
ForeignKey_msgKeyDatatypeMismatch=Das Element {0} des Fremdschl\u00FCssel hat einen anderen Datentyp als das dazugeh\u00F6rige Element {1}. 
ForeignKey_msgKeyItemMissmatch=Das Fremdschl\u00FCssel-Element ist ein Bereich, der referenzierte Schl\u00FCssel ist jedoch eine Spalte\!
UniqueKey_msgKeyItemMismatch=Das Schl\u00FCsselelement {0} bezieht sich weder auf einen Spalte noch einen Bereich.
TableStructureType_lableMultipleContents=Mehrere Inhalte
ForeignKey_msgInvalidKeyItem=Das Schl\u00FCsselelement {0} benennt keine Spalte und keinen Bereich.
ForeignKey_msgKeyMissmatch=Das Element des Fremdschl\u00FCssels ist eine Spalte, aber das Element des referenzierten Schl\u00FCssels ist ein Bereich\!
ForeignKey_msgMissingUniqueKey=Die Tabelle {0} enth\u00E4lt keinen Unique Key {1}. 
ForeignKey_msgForeignKeyDatatypeMismatch=Die Spalte {0} des Fremdschl\u00FCssel hat einen anderen Datentyp als dessen zugeh\u00F6rige Spalte {1}. 
ForeignKey_msgNotAColumn=Die Datentyp-Validit\u00E4t kann nicht gepr\u00FCft werden, da das Element {0} im referenzierten Unique Key keine Spalte identifiziert.
ColumnRange_msgMissingColumn=Die Tabelle enth\u00E4lt keine Spalte mit dem Namen {0}.
ColumnRange_msgParameterEmpty=Das Attribut name des Parameters darf nicht leer sein.
ColumnRange_msgNameInvalidJavaIdentifier=Das Attribut \"Parameter Name\" muss ein g\u00FCltiger Java identifier sein.
ForeignKey_msgMalformedForeignKey=Der Fremdschl\u00FCssel muss so viele Schl\u00FCsselemente enthalten wie der Unique Key.
ForeignKey_msgReferencedRangeInvalid=Die Datentyp-Validit\u00E4t kann nicht gepr\u00FCft werden, da der Bereich im referenzierten Schl\u00FCssel ung\u00FCltig ist.
TableStructure_descriptionEnd=\ und liefert den Wert in der Spalte
TableStructure_msgMoreThanOneKeyNotAdvisableInFormulas=Tabelleninhalte die diese Tabellenstruktur verwenden, k\u00F6nnen nicht in Formeln verwendet werden, da die Tabellenfunktionen nicht eindeutig bestimmt werden k\u00F6nnen. 
TableStructureType_labelEnumTypeModel=Aufz\u00E4hlungstyp (Werte sind Teil des Modells)
ForeignKey_msgInvalidRange=Die Datentyp-Validit\u00E4t kann nicht gepr\u00FCft werden, da der Bereich ung\u00FCltig ist.
Column_msgPrimitvesArentSupported=Spalten muessen ein nicht-primitiven Datatyp haben.
TableStructureType_labelSingleContent=Ein Inhalt
Column_msgInvalidName=Der gew\u00E4hlte Name ist nicht g\u00FCltig.
UniqueKey_msgTooLessItems=Ein Schl\u00FCssel muss mindestens ein Element enthalten.
UniqueKey_wrong_sequence=Die Bereichsschl\u00FCsselelemente m\u00FCssen nach den Spaltenschl\u00FCsselelementen angeordnet werden.
TableStructure_descriptionStart=Die Funktion ermittelt die Zeile identifiziert durch  
ColumnRange_msgDatatypeInvalidForRange=Die Spalte mit dem Datentyp {0} ist f\u00FCr einen Bereich nicht geeignet
ForeignKey_msgNotARange=Die Datentyp-Validit\u00E4t kann nicht gepr\u00FCft werden, da das Element {0} im referenzierten Unique Key keinen Bereich benennt.
