Relation_msgErrorMaxCardinalityMalformed=Maximale Kardinalit\u00e4t muss entweder eine Zahl oder ein Stern (*) sein.
Relation_msgMaxCardinalityMustBeAtLeast1=Maximale Kardinalit\u00e4t muss mindestens 1 sein.
Relation_msgMaxCardinalityForContainerRelationTooLow=Maximale Kardinalit\u00e4t f\u00fcr eine Container Relation muss gr\u00f6\u00dfer sein als 1 (sonst ist es keine Container Relation).
Relation_msgMinCardinalityGreaterThanMaxCardinality=Minimale Kardinalit\u00e4t ist gr\u00f6\u00dfer als die Maximale Kardinalit\u00e4t.
Relation_msgContainerRelNotInSupertype=Die Container Relation {0} existiert in der Supertyp-Hirarchie nicht.
Relation_msgNotMarkedAsContainerRel=Die Beziehung ist nicht als Container Relation gekennzeichnet 
Relation_msgNoTarget=Das Ziel der Container Relation ist leer oder existiert nicht\!
Relation_msgTargetNotSubclass=Das Ziel dieser Beziehung ist weder die in der Container Relation als Ziel definierte Klasse noch eine Subklasse davon.
Relation_msgContainerRelNotReverseRel=Die Container Relation is nicht die R\u00fcckbeziehung der Container Relation der R\u00fcckbeziehung.
Relation_msgSamePluralRolename=Die Beziehung hat den gleichen Rollennamen (Mehrzahl) wie die Container Relation.
Relation_msgSameSingularRoleName=Die Beziehung hat den gleichen Rollennamen (Einzahl) wie die Container Relation.
Relation_msgRelationNotInTarget=Die Beziehung {0} existiert im Ziel {1} nicht. 
Relation_msgReverseRelationNotSpecified=Die R\u00fcckbeziehung nennt nicht diese Beziehung als ihre R\u00fcckbeziehung\!
Relation_msgReverseRelOfContainerRelMustBeContainerRelToo=Die R\u00fcckbeziehung einer Container Relation muss wiederum eine Container Relation sein\!
Relation_msgReverseCompositionMissmatch=Die R\u00fcckbeziehung zu einer Komposition muss eine R\u00fcck-Komposition sein\!
Relation_msgReverseAssociationMissmatch=Die R\u00fcckbeziehung zu einer Assoziation muss wieder eine Assoziation sein\!
Method_msgNameEmpty=Der Name ist leer\!
Method_msgInvalidMethodname=Ung\u00fcltiger Methodenname.
Method_msgTypeEmpty=Der Typ ist leer\!
Method_msgDatatypeNotFound=Der Datentyp {0} exisitert im Objekt-Pfad nicht\!
Method_abstractMethodError=Die abstrakte Methode {0} kann nur in einer abstrakten Klasse definiert werden\!
Method_msgInvalidParameterName=Ung\u00fcltiger Parametername.
Method_msgDatatypeEmpty=Der Datentyp ist leer\!
ValidationRule_msgFunctionNotExists=Die Funktion {0} existiert nicht.
ValidationRule_msgIgnored=Diese Regel wird in allen Gesch\u00e4ftsvorf\u00e4llen angewandt, diese Information wird ignoriert.
ValidationRule_msgUndefinedAttribute=Das angegebene Attribut ist in der Vertragskomponentenklasse dieser Regel nicht definiert.
ValidationRule_msgDuplicateEntries=Doppelte Eintr\u00e4ge.
Attribute_msgInvalidAttributeName=Ung\u00fcltiger Attributsname 
Attribute_msgDefaultNotParsable_UnknownDatatype=Der Standardwert {0} kann nicht analysiert werden, da der Datentyp unbekannt ist\!
Attribute_msgValueNotParsable_InvalidDatatype=Der Standardwert {0} kann nicht analysiert werden, da der Datentyp kein Werte-Datentyp ist.\!
Attribute_msgValueTypeMismatch=Der Standardwert {0} ist kein {1}.
Attribute_msgDefaultNotInValueset=Der Standardwert {0} ist in der angegeben Wertemenge nicht enthalten\!
Attribute_msgDefaultValueIsEmptyString="leerer String"
Attribute_msgNoInputparams=Es sind keine Parameter als Eingabe f\u00fcr die Formeln definiert.
Attribute_msgNoParamsNeccessary=Die Angabe von Parametern zu Berechnung ist nur notwendig, wenn das Attribut als berechnet und produktrelevant ist.
Attribute_msgEmptyName=Der Name ist leer\!
Attribute_msgInvalidParamName=Ung\u00fcltiger Parametername.
Attribute_msgDatatypeEmpty=Der Datentyp ist leer\!
Attribute_msgDatatypeNotFound=Der Datentyp {0} existiert im Objektpfad nicht\!
PolicyCmptType_msgSupertypeNotFound=Der Supertyp {0} existiert nicht\!
PolicyCmptType_msgNameMissing=Der Name der Produktkomponente fehlt.
PolicyCmptType_msgAbstractMissmatch=Nur ein abstrakter Typ kann abstrakte Methoden haben.
PolicyCmptType_msgMustOverrideAbstractMethod=Die abstrakte Methode {0} definiert durch {1} muss \u00fcberschrieben werden. 
