#File modified by LocalizationHelper
#Wed Jun 28 18:24:59 CEST 2006
Relation_msgRelationCanBeProductRelevantOnlyIfTypeIs=Eine Beziehung kann nur dann produkt relevant sein wenn es auch der Typ ist.
Method_msgDatatypeNotFound=Der Datentyp {0} exisitert im Objekt-Pfad nicht\!
Relation_msgErrorMaxCardinalityMalformed=Maximale Kardinalit\u00E4t muss entweder eine Zahl oder ein Stern (*) sein.
Relation_msgNoTarget=Das Ziel der Container-Beziehung ist leer oder existiert nicht\!
ValidationRule_msgFunctionNotExists=Die Funktion {0} existiert nicht.
Method_msgDatatypeEmpty=Der Datentyp ist leer\!
Attribute_msgNameCollision=Namesnkollision mit {0}\:{1}
Attribute_msgAttributeCantBeProductRelevantIfTypeIsNot=Ein Attribut kann nicht als produkt relevant markiert sein wenn es der Typ nicht ist.
Relation_msgImplementationMustHaveSameProductRelevantValue=Eine Beziehung, die eine abstrakte Beziehung (Container Relation) implementiert muss den gleichen Wert bei "Produktrelevant" haben wie die abstrakte Beziehung selbst.
Relation_msgNotMarkedAsContainerRel=Die Beziehung ist nicht als Container-Beziehung gekennzeichnet 
Relation_msgMaxCardinalityMustBeAtLeast1=Maximale Kardinalit\u00E4t muss mindestens 1 sein.
Attribute_msgDefaultValueIsEmptyString="leerer String"
Method_msgTypeEmpty=Der Typ ist leer\!
Relation_msgReverseRelOfContainerRelMustBeContainerRelToo=Die R\u00FCckbeziehung einer Container-Beziehung muss wiederum eine Container-Beziehung sein\!
PolicyCmptType_msgNameMissing=Der Name des Produktbausteintyps fehlt.
Attribute_msgNameCollisionLocal=Ein anderes Attribut mit dem gleichen Namen existiert innerhalb dieses Typs.
Attribute_msgEmptyName=Der Name ist leer\!
Attribute_msgInvalidParamName=Ung\u00FCltiger Parametername.
Method_abstractMethodError=Die abstrakte Methode {0} kann nur in einer abstrakten Klasse definiert werden\!
Attribute_msgDatatypeEmpty=Der Datentyp ist leer\!
Relation_msgReverseCompositionCantBeMarkedAsProductRelevant=Eine R\u00FCckbeziehung kann nicht produktrelevant sein.
Attribute_msgValueNotParsable_InvalidDatatype=Der Vorbelegungswert {0} kann nicht analysiert werden, da der Datentyp kein Werte-Datentyp ist.\!
Relation_msgReverseRelationNotSpecified=Die R\u00FCckbeziehung nennt nicht diese Beziehung als ihre R\u00FCckbeziehung\!
Attribute_msgNothingToOverwrite=Das Attribut {0} existiert in der Supertyp-Hierarchie nicht, daher kann nichts \u00FCberschrieben werden.
Relation_msgNoTargetRoleSingular=Die Beziehung ist produktrelevant, es ist jedoch f\u00FCr die Produktseite kein Name der Zielrolle Einzahl angegeben.
Relation_msgNoTargetRolePlural=Die Beziehung ist produktrelevant, es ist jedoch f\u00FCr die Produktseite kein Name der Zielrolle Mehrzahl angegeben.
Attribute_msgDefaultNotParsable_UnknownDatatype=Der Standardwert {0} kann nicht analysiert werden, da der Datentyp unbekannt ist\!
Relation_msgSameSingularRoleName=Die Beziehung hat den gleichen Rollennamen (Einzahl) wie die Container-Beziehung.
PolicyCmptType_msgMustImplementAbstractRelation=Die Vertragsklasse muss als abstrakt markiert werden, da nicht alle abstrakten Beziehungen (Container Relations) implementiert sind.
ValidationRule_msgUndefinedAttribute=Das angegebene Attribut ist in der Vertragskomponentenklasse dieser Regel nicht definiert.
Relation_msgContainerRelNotReverseRel=Die Container-Beziehung ist nicht die R\u00FCckbeziehung der Container-Beziehung der R\u00FCckbeziehung.
ValidationRule_msgDuplicateEntries=Doppelte Eintr\u00E4ge.
Attribute_msgDefaultNotInValueset=Der Standardwert {0} ist in der angegeben Wertemenge nicht enthalten\!
ValidationRule_msgIgnored=Diese Regel wird in allen Gesch\u00E4ftsvorf\u00E4llen angewandt, diese Information wird ignoriert.
PolicyCmptType_msgAbstractMissmatch=Nur ein abstrakter Typ kann abstrakte Methoden haben.
Relation_msgTargetRoleSingularIlleaglySameAsTargetRolePlural=Der Name der Zielrolle Einzahl und der Name der Zielrolle Mehrzahl d\u00FCrfen nicht identisch sein.
Relation_msgMaxCardinalityForContainerRelationTooLow=Maximale Kardinalit\u00E4t f\u00FCr eine Container-Beziehung muss gr\u00F6\u00DFer sein als 1 (sonst ist es keine Container-Beziehung).
Attribute_msgDatatypeNotFound=Der Datentyp {0} existiert im Objektpfad nicht\!
PolicyCmptType_msgSupertypeNotFound=Der Supertyp {0} existiert nicht\!
Attribute_msgValueTypeMismatch=Der Standardwert {0} ist kein {1}.
Relation_msgReverseAssociationMissmatch=Die R\u00FCckbeziehung zu einer Assoziation muss wieder eine Assoziation sein\!
PolicyCmptType_msgInconsistentTypeHierarchy=Die Supertyp-Hirarchie dieses Typs ist nicht konsistent.
Relation_msgRevereseCompositionMustHaveMaxCardinality1=Eine R\u00FCckbeziehung muss die maximale Kardinalit\u00E4t von 1 haben.
Relation_msgContainerRelNotInSupertype=Die Container-Beziehung {0} existiert in der Supertyp-Hierarchie nicht.
Attribute_msgInvalidAttributeName=Ung\u00FCltiger Attributsname 
Method_msgNameEmpty=Der Name ist leer\!
Relation_msgRelationNotInTarget=Die Beziehung {0} existiert im Ziel {1} nicht. 
PolicyCmptType_msgMustOverrideAbstractMethod=Die abstrakte Methode {0} definiert durch {1} muss \u00FCberschrieben werden. 
Method_msgInvalidMethodname=Ung\u00FCltiger Methodenname.
Relation_msgReverseCompositionMissmatch=Die R\u00FCckbeziehung zu einer Komposition muss eine R\u00FCck-Komposition sein\!
PolicyCmptType_msgInvalidProductCmptTypeName=Der Name des Produktbausteintyps ist nicht korrekt.
Attribute_msgNoInputparams=Es sind keine Parameter als Eingabe f\u00FCr die Formeln definiert.
Attribute_msgNoParamsNeccessary=Die Angabe von Parametern zu Berechnung ist nur notwendig, wenn das Attribut als berechnet und produktrelevant ist.
Attribute_msgpartUnknown=unbekannt
Relation_msgSamePluralRolename=Die Beziehung hat den gleichen Rollennamen (Mehrzahl) wie die Container-Beziehung.
Method_msgInvalidParameterName=Ung\u00FCltiger Parametername.
Relation_msgTargetNotSubclass=Das Ziel dieser Beziehung ist weder die in der Container-Beziheung als Ziel definierte Klasse noch eine Subklasse davon.
PolicyCmptType_msgNameMissmatch=Der Name des Produktbausteintyps kann nicht identisch sein mit dem Namen der Vertragsklasse.
Relation_msgMinCardinalityGreaterThanMaxCardinality=Minimale Kardinalit\u00E4t ist gr\u00F6\u00DFer als die Maximale Kardinalit\u00E4t.
PolicyCmptType_msgMustImplementContainerRelation=Der Typ muss entweder die Container-Beziehhung {0} definiert in {1} implementieren oder als abstrakt markiert werden. 